In [2]:
import pandas as pd

In [3]:
dataset_so=pd.read_csv('survey_results_public.csv', index_col='ResponseId') #index_col is used to make a col as default

In [4]:
# Creating a small dataframe to learn then we will apply the concept on large dataset
dict1={
 'First Name':['Ritesh','Muggu','Alex','Rocky','Md'],"Last Name":['Stark','Babe','Hales','Bhai','Hales'], 'Designation':['CEO','MD','HR','SE','JE'],'Age':[25,25,27,31,34]
}

In [5]:
df=pd.DataFrame(dict1)

In [6]:
df

  First Name Last Name Designation  Age
0     Ritesh     Stark         CEO   25
1      Muggu      Babe          MD   25
2       Alex     Hales          HR   27
3      Rocky      Bhai          SE   31
4         Md     Hales          JE   34

### Updating Rows & Columns

In [7]:
df.columns

Index(['First Name', 'Last Name', 'Designation', 'Age'], dtype='object')

In [10]:
df.columns=['F N','L N','Post','Age']

In [11]:
df

      F N    L N Post  Age
0  Ritesh  Stark  CEO   25
1   Muggu   Babe   MD   25
2    Alex  Hales   HR   27
3   Rocky   Bhai   SE   31
4      Md  Hales   JE   34

In [13]:
#changing col names into upper case
df.columns=[x.upper() for x in df.columns]

In [14]:
df

      F N    L N POST  AGE
0  Ritesh  Stark  CEO   25
1   Muggu   Babe   MD   25
2    Alex  Hales   HR   27
3   Rocky   Bhai   SE   31
4      Md  Hales   JE   34

In [15]:
#Replacing spaces with Underscore
df.columns=df.columns.str.replace(' ','_')

In [16]:
df

      F_N    L_N POST  AGE
0  Ritesh  Stark  CEO   25
1   Muggu   Babe   MD   25
2    Alex  Hales   HR   27
3   Rocky   Bhai   SE   31
4      Md  Hales   JE   34

In [17]:
df.columns=[x.lower() for x in df.columns]

In [18]:
df

      f_n    l_n post  age
0  Ritesh  Stark  CEO   25
1   Muggu   Babe   MD   25
2    Alex  Hales   HR   27
3   Rocky   Bhai   SE   31
4      Md  Hales   JE   34

In [20]:
   df.rename(columns={'f_n':'FirstName','l_n':'LastName'})

  FirstName LastName post  age
0    Ritesh    Stark  CEO   25
1     Muggu     Babe   MD   25
2      Alex    Hales   HR   27
3     Rocky     Bhai   SE   31
4        Md    Hales   JE   34

In [21]:
df #changes did not occur in original

      f_n    l_n post  age
0  Ritesh  Stark  CEO   25
1   Muggu   Babe   MD   25
2    Alex  Hales   HR   27
3   Rocky   Bhai   SE   31
4      Md  Hales   JE   34

In [22]:
 df.rename(columns={'f_n':'FirstName','l_n':'LastName'}, inplace='True')

In [23]:
df

  FirstName LastName post  age
0    Ritesh    Stark  CEO   25
1     Muggu     Babe   MD   25
2      Alex    Hales   HR   27
3     Rocky     Bhai   SE   31
4        Md    Hales   JE   34

 ### Changing the values

In [24]:
df.loc[2]

FirstName     Alex
LastName     Hales
post            HR
age             27
Name: 2, dtype: object

In [25]:
df.loc[2,['post','age']]

post    HR
age     27
Name: 2, dtype: object

In [28]:
#updating data 

df.loc[2,['post','age']]=['Senior HR','28']

In [27]:
df

  FirstName LastName       post age
0    Ritesh    Stark        CEO  25
1     Muggu     Babe         MD  25
2      Alex    Hales  Senior HR  28
3     Rocky     Bhai         SE  31
4        Md    Hales         JE  34

In [32]:
filtr=(df['FirstName']=='Md')
df.loc[filtr,'post']='AE'

In [33]:
df

  FirstName LastName       post age
0    Ritesh    Stark        CEO  25
1     Muggu     Babe         MD  25
2      Alex    Hales  Senior HR  28
3     Rocky     Bhai         SE  31
4        Md    Hales         AE  34

In [37]:
email=['RTS@mail.com','Muggas@mail.com', 'alex@mail.com','rock@mail.com','hales@mail.com']

In [38]:
df['Email']=email

In [39]:
df

  FirstName LastName       post age            Email
0    Ritesh    Stark        CEO  25     RTS@mail.com
1     Muggu     Babe         MD  25  Muggas@mail.com
2      Alex    Hales  Senior HR  28    alex@mail.com
3     Rocky     Bhai         SE  31    rock@mail.com
4        Md    Hales         AE  34   hales@mail.com

### Updating Values

In [40]:
def update_email(email):
    return email.lower()

In [44]:
df['Email'].apply(update_email)

0       rts@mail.com
1    muggas@mail.com
2      alex@mail.com
3      rock@mail.com
4     hales@mail.com
Name: Email, dtype: object

In [60]:
df['Email']=df['Email'].apply(lambda x: x.lower())

In [61]:
df

  FirstName LastName       post age            Email
0    Ritesh    Stark        CEO  25     rts@mail.com
1     Muggu     Babe         MD  25  muggas@mail.com
2      Alex    Hales  Senior HR  28    alex@mail.com
3     Rocky     Bhai         SE  31    rock@mail.com
4        Md    Hales         AE  34   hales@mail.com